# CantCopyStairsLevelHeightNotMatchInMS Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CantCopyStairsLevelHeightNotMatchInMS Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't copy stairs in Multistory Stairs due to level height doesn't match.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantCopyStairsLevelHeightNotMatchInMS { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantCopyStairsLevelHeightNotMatchInMS As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantCopyStairsLevelHeightNotMatchInMS {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace